# Лабораторная работа №0
## Введение в алгоритмы

**Студент:** Джафари Хоссаин  
**Вариант:** 19  
**Дата:** 2025

---

## Задание

Реализовать программу, которая вычисляет сумму двух целых чисел `a` и `b`.

**Входные данные:**
- Два целых числа `a` и `b`, разделённые пробелом
- Ограничения: `-10^9 ≤ a, b ≤ 10^9`

**Выходные данные:**
- Сумма `a + b`

---

## Алгоритм решения

Задача решается тривиально - достаточно прочитать два числа из стандартного потока ввода и вывести их сумму. 

**Алгоритм:**
1. Читаем строку из стандартного потока ввода
2. Разбиваем строку на отдельные элементы по пробелам
3. Проверяем, что было введено ровно два числа
4. Преобразуем строки в целые числа
5. Проверяем, что числа находятся в допустимом диапазоне
6. Вычисляем и выводим сумму

**Временная сложность:** O(1)  
**Пространственная сложность:** O(1)

---

## Реализация

```python
"""Сумма двух целых чисел a + b.

Читает из stdin строку с двумя числами, выводит их сумму.
Ограничения: -1e9 <= a, b <= 1e9.
"""

import sys


def main() -> None:
    data = sys.stdin.read().strip().split()
    if len(data) != 2:
        sys.exit("Ожидалось два числа")
    a, b = map(int, data)
    if not (-10**9 <= a <= 10**9 and -10**9 <= b <= 10**9):
        sys.exit("Числа должны быть в диапазоне [-1e9, 1e9]")
    print(a + b)


if __name__ == "__main__":
    main()
```

### Описание реализации

Программа использует стандартную библиотеку Python `sys` для чтения данных из стандартного потока ввода. 

**Ключевые особенности:**
- Использование `sys.stdin.read()` для чтения всего ввода целиком
- Проверка корректности входных данных (количество чисел и диапазон)
- Обработка ошибок через `sys.exit()` с информативными сообщениями
- Функция `main()` для структурирования кода
- Проверка `__name__ == "__main__"` для возможности использования модуля

---

## Тестирование

### Тестовые примеры для варианта 19

**Тест 1:**
```
Вход: 5 3
Выход: 8
```

**Тест 2:**
```
Вход: -10 20
Выход: 10
```

**Тест 3:**
```
Вход: 0 0
Выход: 0
```

**Тест 4:**
```
Вход: -1000000000 1000000000
Выход: 0
```

**Тест 5:**
```
Вход: 999999999 -999999999
Выход: 0
```

**Тест 6 (граничные случаи):**
```
Вход: 1000000000 1000000000
Выход: 2000000000
```

### Запуск тестов

```bash
# Тест 1
echo "5 3" | python sum_ab.py

# Тест 2
echo "-10 20" | python sum_ab.py

# Тест 3
echo "0 0" | python sum_ab.py
```

---

## Выводы

В ходе выполнения лабораторной работы была реализована программа для вычисления суммы двух целых чисел. Программа корректно обрабатывает входные данные, выполняет проверку на допустимость диапазона значений и выводит результат.

**Особенности реализации:**
- Корректная обработка входных данных
- Проверка граничных значений
- Информативные сообщения об ошибках
- Чистый и читаемый код

Программа успешно прошла все тестовые случаи, включая граничные значения.
