# Лабораторная работа №0
## Введение в алгоритмы

**Студент:** Джафари Хоссаин  
**Вариант:** 19  
**Дата:** 2025

---

## Задание 1. Ввод-вывод

Вам необходимо выполнить 4 следующих задачи:

1. Задача `a + b`. Вычислить сумму двух заданных чисел.
2. Задача `a + b²`. Вычислить значение `a + b²`.
3. Выполнить задачу `a + b` с использованием файлов (input.txt → output.txt).
4. Выполнить задачу `a + b²` с использованием файлов (input.txt → output.txt).

**Общие ограничения:**
- Входные данные: два целых числа `a` и `b`
- Диапазон значений: `-10^9 ≤ a, b ≤ 10^9`

---

## Задача 1: a + b (стандартный ввод-вывод)

### Описание

Вычислить сумму двух целых чисел `a` и `b`.

**Вход:** одна строка, содержащая два целых числа `a` и `b`.  
**Выход:** единственное целое число — результат сложения `a + b`.

### Алгоритм решения

**Временная сложность:** O(1)  
**Пространственная сложность:** O(1)

### Реализация

Файл: `sum_ab.py`

```python
"""Сумма двух целых чисел a + b.

Читает из stdin строку с двумя числами, выводит их сумму.
Ограничения: -1e9 <= a, b <= 1e9.
"""

import sys


def main() -> None:
    data = sys.stdin.read().strip().split()
    if len(data) != 2:
        sys.exit("Ожидалось два числа")
    a, b = map(int, data)
    if not (-10**9 <= a <= 10**9 and -10**9 <= b <= 10**9):
        sys.exit("Числа должны быть в диапазоне [-1e9, 1e9]")
    print(a + b)


if __name__ == "__main__":
    main()
```

### Тестирование

```bash
# Тест 1
echo "5 3" | python sum_ab.py
# Ожидаемый вывод: 8

# Тест 2
echo "-10 20" | python sum_ab.py
# Ожидаемый вывод: 10

# Тест 3
echo "0 0" | python sum_ab.py
# Ожидаемый вывод: 0
```

---

## Задача 2: a + b² (стандартный ввод-вывод)

### Описание

Вычислить значение `a + b²`.

**Вход:** одна строка, содержащая два целых числа `a` и `b`.  
**Выход:** единственное целое число — результат вычисления `a + b²`.

### Алгоритм решения

**Временная сложность:** O(1)  
**Пространственная сложность:** O(1)

### Реализация

Файл: `sum_ab_squared.py`

```python
"""Сумма числа a и квадрата числа b (a + b²).

Читает из stdin строку с двумя числами, выводит результат a + b².
Ограничения: -1e9 <= a, b <= 1e9.
"""

import sys


def main() -> None:
    data = sys.stdin.read().strip().split()
    if len(data) != 2:
        sys.exit("Ожидалось два числа")
    a, b = map(int, data)
    if not (-10**9 <= a <= 10**9 and -10**9 <= b <= 10**9):
        sys.exit("Числа должны быть в диапазоне [-1e9, 1e9]")
    result = a + b * b
    print(result)


if __name__ == "__main__":
    main()
```

### Тестирование

```bash
# Тест 1: a=5, b=3 → 5 + 3² = 5 + 9 = 14
echo "5 3" | python sum_ab_squared.py
# Ожидаемый вывод: 14

# Тест 2: a=-10, b=4 → -10 + 4² = -10 + 16 = 6
echo "-10 4" | python sum_ab_squared.py
# Ожидаемый вывод: 6

# Тест 3: a=0, b=0 → 0 + 0² = 0
echo "0 0" | python sum_ab_squared.py
# Ожидаемый вывод: 0
```

---

## Задача 3: a + b (работа с файлами)

### Описание

Выполнить задачу `a + b` с использованием файлов.

**Входной файл:** `input.txt`  
- Формат: одна строка, содержащая два целых числа `a` и `b`, разделённые пробелом

**Выходной файл:** `output.txt`  
- Формат: единственное целое число — результат сложения `a + b`

### Реализация

Файл: `sum_ab_file.py`

```python
"""Сумма двух целых чисел a + b (работа с файлами).

Читает из файла input.txt два числа, выводит сумму в файл output.txt.
Ограничения: -1e9 <= a, b <= 1e9.
"""


def main() -> None:
    with open('input.txt', 'r', encoding='utf-8') as input_file:
        data = input_file.read().strip().split()
    
    if len(data) != 2:
        raise ValueError("Ожидалось два числа")
    
    a, b = map(int, data)
    if not (-10**9 <= a <= 10**9 and -10**9 <= b <= 10**9):
        raise ValueError("Числа должны быть в диапазоне [-1e9, 1e9]")
    
    result = a + b
    
    with open('output.txt', 'w', encoding='utf-8') as output_file:
        output_file.write(str(result))


if __name__ == "__main__":
    main()
```

### Тестирование

**Пример 1:**
```
input.txt:  12 25
output.txt: 37
```

**Пример 2:**
```
input.txt:  130 61
output.txt: 191
```

```bash
# Подготовка теста
echo "12 25" > input.txt
python sum_ab_file.py
cat output.txt
# Ожидаемый вывод: 37
```

---

## Задача 4: a + b² (работа с файлами)

### Описание

Выполнить задачу `a + b²` с использованием файлов аналогично предыдущему пункту.

**Входной файл:** `input.txt`  
- Формат: одна строка, содержащая два целых числа `a` и `b`, разделённые пробелом

**Выходной файл:** `output.txt`  
- Формат: единственное целое число — результат вычисления `a + b²`

### Реализация

Файл: `sum_ab_squared_file.py`

```python
"""Сумма числа a и квадрата числа b (a + b²) (работа с файлами).

Читает из файла input.txt два числа, выводит результат a + b² в файл output.txt.
Ограничения: -1e9 <= a, b <= 1e9.
"""


def main() -> None:
    with open('input.txt', 'r', encoding='utf-8') as input_file:
        data = input_file.read().strip().split()
    
    if len(data) != 2:
        raise ValueError("Ожидалось два числа")
    
    a, b = map(int, data)
    if not (-10**9 <= a <= 10**9 and -10**9 <= b <= 10**9):
        raise ValueError("Числа должны быть в диапазоне [-1e9, 1e9]")
    
    result = a + b * b
    
    with open('output.txt', 'w', encoding='utf-8') as output_file:
        output_file.write(str(result))


if __name__ == "__main__":
    main()
```

### Тестирование

**Пример 1:**
```
input.txt:  5 3
output.txt: 14  (так как 5 + 3² = 5 + 9 = 14)
```

**Пример 2:**
```
input.txt:  -10 4
output.txt: 6  (так как -10 + 4² = -10 + 16 = 6)
```

```bash
# Подготовка теста
echo "5 3" > input.txt
python sum_ab_squared_file.py
cat output.txt
# Ожидаемый вывод: 14
```

---

## Структура проекта

```
lab0/
├── sum_ab.py                    # Задача 1: a + b (stdin/stdout)
├── sum_ab_squared.py            # Задача 2: a + b² (stdin/stdout)
├── sum_ab_file.py               # Задача 3: a + b (файлы)
├── sum_ab_squared_file.py       # Задача 4: a + b² (файлы)
└── README.md                    # Отчёт о лабораторной работе
```

---

## Выводы

В ходе выполнения лабораторной работы были реализованы четыре программы для работы с базовыми арифметическими операциями:

1. **Программа `a + b`** со стандартным вводом-выводом — демонстрирует работу с потоком stdin/stdout.
2. **Программа `a + b²`** со стандартным вводом-выводом — показывает использование арифметических операций с возведением в степень.
3. **Программа `a + b`** с файлами — демонстрирует работу с файлами для чтения и записи данных.
4. **Программа `a + b²`** с файлами — комбинирует работу с файлами и вычисления.

**Общие особенности реализации:**
- Корректная обработка входных данных
- Проверка граничных значений (диапазон `-10^9` до `10^9`)
- Информативные сообщения об ошибках
- Чистый и читаемый код
- Использование контекстных менеджеров (`with`) для работы с файлами
- Правильная обработка кодировки UTF-8 при работе с файлами

Все программы успешно прошли тестирование, включая граничные случаи и различные комбинации входных данных.
